# Задача-1:
# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка,
# выровненного по правой стороне.

# Пример:
# Дано: ["яблоко", "банан", "киви", "арбуз"]
# Вывод:
# 1. яблоко
# 2.  банан
# 3.   киви
# 4.  арбуз

# Подсказка: воспользоваться методом .format()
print('***TASK 1***')
fruits = ['арбуз', 'банан', 'апельсин', 'яблоко']
for i in range(len(fruits)):
    print('{}.{:>0}'.format(i + 1, fruits[i].rjust(9, ' '))) #как вариант вместо 9 отступов можно прописать длину самого длинного слова +1


# Задача-2:
# Даны два произвольные списка.
# Удалите из первого списка элементы, присутствующие во втором списке.
print('***TASK 2***')
a = {1, 2, 3, 4}
b = {3, 4, 5, 6}
a = a - b
print(a)


# Задача-3:
# Дан произвольный список из целых чисел.
# Получите НОВЫЙ список из элементов исходного, выполнив следующие условия:
# если элемент кратен двум, то разделить его на 4, если не кратен, то умножить на два.
print('***TASK 3***')
initial = [2, 4, 16, 12, 5, 3, 0, 36]
new = []
for element in initial:
    if element % 2 == 0:
        new.append(element / 4)
    else:
        new.append(element * 2)
print(new)